performance-tests/stress_test.yml
config:
  target: "http://127.0.0.1:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Warm up the API"
    - duration: 180
      arrivalRate: 100
      rampTo: 300
      name: "Stress load"
  payload:
    # We will pass the token as an environment variable or define it here, but Artillery allows using env vars directly.
    # $processEnvironment.TOKEN
  environments:
    local:
      target: "http://127.0.0.1:3001"
scenarios:
  - name: "Dashboard fetch flow"
    weight: 5
    flow:
      - get:
          url: "/v1/dashboard/summary"
          headers:
            authorization: "Bearer {{ $processEnvironment.TOKEN }}"
      - get:
          url: "/v1/categories"
          headers:
            authorization: "Bearer {{ $processEnvironment.TOKEN }}"
  - name: "Tasks list flow"
    weight: 3
    flow:
      - get:
          url: "/v1/tasks?limit=50&page=1"
          headers:
            authorization: "Bearer {{ $processEnvironment.TOKEN }}"
  - name: "Create task flow"
    weight: 1
    flow:
      - post:
          url: "/v1/tasks"
          headers:
            authorization: "Bearer {{ $processEnvironment.TOKEN }}"
            content-type: "application/json"
          json:
            title: "Stress Test Task {{ $randomString() }}"
            priority: "medium"
            estimated_duration_minutes: 30
  - name: "Public health check"
    weight: 1
    flow:
      - get:
          url: "/health/detailed"